
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_organization_ruleset.pr_ruleset will be created
  + resource "github_organization_ruleset" "pr_ruleset" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "require-pull-requests"
      + node_id     = (known after apply)
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~ALL",
                ]
            }

          + repository_name {
              + exclude   = []
              + include   = [
                  + "~ALL",
                ]
              + protected = false
            }
        }

      + rules {
          + creation                = true
          + deletion                = true
          + required_linear_history = true
          + required_signatures     = true
          + update                  = true

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - hello_world_file = "./hello_world.txt" -> null

<!-- Sticky Pull Request Commentterraform-plan -->